tutorials/multicomponentFluid/shearlayer_DLB_pyJac/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | DLBFoam: Dynamic Load Balancing                 |
|  \\    /   O peration     | for fast reactive simulations                   |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  | 2020, Aalto University, Finland                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#includeEtc "caseDicts/solvers/chemistry/TDAC/chemistryProperties.cfg"
refmapping
{
    active          true;
    mixtureFractionProperties
    {
        oxidizerMassFractions
        {
            N2              0.77;
            O2              0.23;
        }
        fuelMassFractions
        {
            NC12H26           1;
        }
        #include "$FOAM_CASE/constant/foam/thermo.foam"
    }
    tolerance       0.0001;
}

loadbalancing
{
	active	true;
	log	true;
}

chemistry       on;

initialChemicalTimeStep 1;

chemistryType
{
    solver          ode_pyJac;
    method          loadBalanced_pyJac;
}

odeCoeffs
{
    solver          seulex_LAPACK;
    absTol          1e-08;
    relTol          1e-05;
}
reduction
{
}

tabulation
{
	method	ISAT_pyJac;
}

reactions
{
}
// ************************************************************************* //
